    
[
    {
        "id":0,
        "title":"Rongo University – Goldmine of knowledge and innovation",
        "image":"assests/rongo.jpg",
        "authorImage":"assests/imran.jpeg",
        "author":"Imran matano",
        "body":"Rongo University (RU), formerly Rongo University College is a public university and was awarded Charter to full fledge university by H.E. Hon. Uhuru Kenyatta, the President of the Republic of Kenya on <b>7th October 2016</b>. The University derives its mandate from the Rongo University Charter of 7th October, 2016, which stipulates the objects and functions including teaching research and community service.<br/><br/><h2>Location</h2> The University is located at Kitere Hills situated in the South Western part of Kenya bordering Tanzania, in Rongo Sub-County, Migori County, Kenya. The University is 11 kilometres from Rongo Town, and 2.5 kilometres off Rongo– Migori- Highway. It is located in a gold mining and high Agricultural potential area.<br/><br/><h2>Her vision</h2> The university's vision lays on creating a world class technology driven University in learning and practice. <br/><br/><h2>Core values</h2>Some of its core values found are: <ul><li>intergrity,</li> <li>equity</li></ul>",
         "date":"2/2/2023"
    },
    {
        "id":1,
        "title":"Google Solution challenge Info Session",
        "image":"assests/solution.png",
        "authorImage":"assests/imran.jpeg",
        "author":"Imran matano",
        "body":"This will be an interactive session to discuss about Google solution challenge. <br/><br/><h2>The Agenda</h2> <ol style='margin:0 20px;'> <li>Go through the registration steps, requirements and schedule.</li> <li> Clear all doubts by carrying an interactive session with questions and answering activity.</li> <li> Understanding the judging criteria, workshops, prizes and more.</li></ol> <br/><h2>Facilitator</h2> <ol style='margin:0 20px;'><li>Derrickson Ndambuki : Android and web developer.</li> </ol> <br/><h2>Host</h2> <ul><li>Trizah Nabwire : UIUX Designer @SpaceYaTech. </li> </ul> <br/><h2>Organizers</h2><ol style='margin:0 20px;'> <li>Mori Keli : GDSC Lead</li> <li>Imran Matano : Marketing Lead</li> <li>Irene Macharia : Event Organizer.</li> </ol> <br/><br/>RSVP: <a style='color:purple;' href='https://gdsc.community.dev/e/mmzxe9/' target='_blank'>https://gdsc.community.dev/e/mmzxe9/</a> .<p>Venue: Rongo University - SSAE Computer Lab</p></p>Starting on: Fri, Jan 27, 2:00 PM</p>",
         "date":"27/1/2023"
    },
    {
        "id":2,
        "title":"Rongo University Google Developer Student club",
        "image":"assests/gdcs.jpg",
        "authorImage":"assests/imran.jpeg",
        "author":"Imran matano",
        "body":"Google developer student club is a group of students that tries to bridge the gap between theory and practical application by carrying out weekly events, most events are held on every friday around 2:00pm in the afternoon. <br/><br/><p>These students practive coding and problem-solving by creating projects. By doing this, students get to learn, grow and connect with each other. This club promotes an interractive learning where the event speaker emerges with his/her audience.</p><br/><br/>The Club Organizers are:<br/> <ol style='margin:0 20px;'><li>Mori Keli - GDSC Lead</li> <li>Trizah Nabwire - Technical Lead</li> <li>Imran Matano - Marketing Lead</li> <li>Irene Machari - Event Organizer</li> <li>Peninah - Secretary</li></ol><br/> Be free to join the Rongo University GDSC by viewing <a style='margin:0 5px; text-decoration:underline; color:purple;' href='https://gdsc.community.dev/rongo-university/' target='_blank'>GDSC Rongo</a>. <p>Join our whatsapp group <a style='color:green;' href='https://chat.whatsapp.com/FYmtXnqePzo4mFOk52kbSj' target='_blank'><i class='fa fa-whatsapp'></i> GDSC Group</a></p><br/> For more info, call <b><a href='tel:0734720752'>0734720752</a></b>",
         "date":"27/1/2023"
    },
    {
        "id":3,
        "title":"How to approach your studies as a university student",
        "image":"assests/students.jpg",
        "authorImage":"assests/imran.jpeg",
        "author":"Imran matano",
        "body":"Being Properly Organized And Prepared For Tests And Exams Can Make All The Difference To School Performance. Effective Studying Starts With The Right Attitude—A Positive Outlook Can Shift Studying From A Punishment To An Opportunity To Learn.<br/><br/> <p>There are different ways to approach your studies as a student keeping in mind that different students have different abilities of comprehending information. Some students get easily motivated while others take long to be motivated. this explains why students academic performance varies from each other though they attend same classes.</p><br/><br/><p>Finding the best way of approaching your studies is an ongoing process and need inner motivation. <i>Studying is hard</i>, that's a fact. Waking up early in the morning to study or sleeping late while stuying is not an easy task for anyone.</p> <br/><br/><h2>Below I've a list five good study behaviors that you can incorporate on your routine.</h2><ol style='margin:0 20px;'><li>Get Organised : Create a daily schedule on what you would like to achieve daily or weekly. </li> <li>Be attentive in classes: Not only will give you confidence during tests but it will also help you in comprehending what the lecturers taught that day.</li><li>Take short note: Taking short relevant notes helps in memorizing and revising.</li><li>Asking questions during lectures, if the concepts isn't understood : promotes understanding and makes the lecture interractive.</li><li>Avoid distraction : This brings focus and lets the learner emerge in activities more related to his/her goals.</li></ol> <br/><br/><sub>The picture was taken at kenyatta University (KU)</sub>",
         "date":"1/2/2023"
    },
    {
        "id":4,
        "title":"How to deal with negativity",
        "image":"assests/negativity.jpg",
        "authorImage":"assests/imran.jpeg",
        "author":"Imran matano",
        "body":"Often, many university students get depressed, the society may not know this but many students get depressed. Now are the days where youths contribute a large portion on mental illness. I've seen young souls take the away the lives because of depression. It's clear that life isn't easy like the past. Life difficults have real contributed in many young man get depressed.<br/><br/> Depression is a progressive infection, it develops with time in the victim's mind if not treated by counselling or mental treatment then its develops into full where physical trait start to appear such as the victim isolates himself from others or start speaking by himself with no reason. <p>Most people ignore mental treatment until they get affect. You are advised to take all treatment seriously.</p><br/><br/><h2>Below is a list on how to deal with negativity</h2><ol style='margin:0 20px;'><li>Exercising on a regular basis can have a profound positive impact on both your physical and mental health. One benefit exercise brings is that it can help relieve inner tension and worries.</li><li>Talk It Over : Go talk with your trusted friend or mentor, this helps to relief the burden or stress, you will often get advice and get well afterwards.</li><li>Find a Way to Be Grateful : To rid yourself of negative thoughts, try spending 15 min a day writing down your thought process. Doing this can help you identify how your thoughts are becoming distorted.</li><li>Don't stay alone: interract with your loved ones and family, this helps.</li><li>Avoid bad companies</li><li>Don't set unrealistic goals : common stress mostly comes from unfulfilled objectives. Only set fewer and real goals.</li><li>Eat healthy and avoid drug abuse : healthy eating promote positive thoughts.</li><li>Take mental therapy if you can afford it or practice meditation : meditation helps is relieving stress and bring calmness.</li></ol>",
        "date":"1/12/2023"
    }
]